{
  "main": {
    "name": "Kevin Yao",
    "occupation": "Goldwater Scholar, Davidson Fellow, and TAMU Brown Scholar pursuing Computer Engineering",
    "description": "I am dedicated to researching and developing machine learning and software solutions to global healthcare issues",
    "image": "profilepic.jpg",
    "bio": "I am programmer, researcher, physicist, and aspiring physician. The type to spend his summer days taking classes and evenings self-learning quantum mechanics and deep learning. To pursue medical school while majoring in computer engineering. To work in three research labs involving investigating next-generation two-dimensional nanomaterials, developing a mobile application to examine strokes, and developing my own deep learning models for prediction of cancer prognosis. And to powerlift, dance, and play guitar. In it all, I have found that being able to LEARN is the most exciting aspect of life. My next steps in my career is to work in a tech company, gain experience in tech leadership, and earn a M.D., allowing me to determine and innnovate computational solutions to imminent healthcare issues.",
    "contactmessage": "Please contact me using the below form, or by email or phone if you have any questions.",
    "email": "ksyao2002@gmail.com",
    "phone": "346-307-5241",
    "address": {
      "street": "28011 Bracken Hurst Dr.",
      "city": "Katy",
      "state": "TX",
      "zip": "77494"
    },
    "website": "https://ksyao2002.github.io/",
    "resumedownload": "https://docs.google.com/uc?export=download&id=1PrutJ5Xs731SPQsbFIcXIQyTHd426k2G",
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/kevin.yao.9469/",
        "className": "fa fa-facebook"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/kevin-yao-62aa2b174/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/kevin.yao.thephysicist/?hl=en",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "https://github.com/ksyao2002",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "Here is a list of a couple of my skills",
    "education": [
      {
        "school": "Texas A&M University",
        "degree": "B.S. in computer engineering",
        "graduated": "May 2023",
        "description": "Brown Scholar, pursued computer science and electrical engineering courses with a focus on machine learning and software development"
      },
      {
        "school": "Texas Academy of Math and Science",
        "degree": "Computer Science",
        "graduated": "May 2020",
        "description": "Private boarding school, where I attended computer sciences with other undergraduate students at the University of North Texas"
      }
    ],
    "work": [
      {
        "company": "Amazon",
        "title": "Software Development Engineer Intern",
        "years": "May 2022 - August 2022",
        "description": "I designed and defended a new architecture to execute SQL queries in DynanmoDB. I also deployed AWS redshift cluster, scheduled lambda, and other AWS resources with Golang/Java. Lastly, I fronted SQL query support for Docker Containers, which decreased on-call workload by ~6 hrs/month"
      },
      {
        "company": "Baylor College of Medicine",
        "title": "Senior Undergraduate Researcher",
        "years": "August 2020 - May 2022",
        "description": "I devised, validated, and reported a multiple-gene signature to predict prognosis of breast cancer. I also developed convolutional neural networks for analysis of histopathology images using Pytorch. Lastly, I have utilized statistical and machine learning methods in R such as Random Forest."
      },
      {
        "company": "Houston Methodist Hospital",
        "title": "Software Engineer, Researcher",
        "years": "May 2020 - August 2021",
        "description": "I produced a mobile application interface using Unity/Swift to optimize patient-doctor interaction, and developed and connected a Django-based backend to frontend for stroke prediction on the cloud. I also developed machine learning models and processing to determine patient risk for stroke on the NIHSS scale"
      },
      {
        "company": "University of North Texas",
        "title": "Senior Researcher, Lab Manager",
        "years": "May 2018 - August 2020",
        "description": "I discovered and led a project on degradation of MoS2 in air and developed novel degradation prevention methods. I also conceived of and orchestrated the characterization the stability of MoS2 bilayers in air. Lastly, I managed lab members, assisted and mentored new students, and led weekly meetings."
      },
      {
        "company": "Scope Research",
        "title": "Co-founder, Co-president, and Product Manager",
        "years": "January 2019 - Present",
        "description": "I organized and led a 20-person executive team to outreach, market, and develop website. I conceived of new programs for underprivileged students to be introduced to research. I also reached out to professors and students through presentations."
      }
    ],
    "publications": [
      {
        "company": "AB‐Raf V600E gene signature for melanoma predicts prognosis and reveals sensitivity to targeted therapies",
        "title": "Kevin Yao, Emily Zhou, Chao Cheng",
        "years": "2022",
        "description": "Cancer Medicine 11 (4), 1232-1243"
      },
      {
        "company": "A framework to predict the applicability of Oncotype DX, MammaPrint, and E2F4 gene signatures for improving breast cancer prognostic prediction",
        "title": "K Yao, CY Tong, C Cheng",
        "years": "2022",
        "description": "Scientific reports 12 (1), 1-11"
      },
      {
        "company": "Tumor cell intrinsic and extrinsic features predict prognosis in estrogen receptor positive breast cancer",
        "title": "K Yao, E Schaafsma, B Zhang, C Cheng",
        "years": "2022",
        "description": "PLoS computational biology 18 (3), e1009495"
      },
      {
        "company": "Intelligent Augmented Lifelike Avatar App for Virtual Physical Examination of Suspected Strokes.",
        "title": "Kevin Yao, Kelvin K. Wong, Xiaohui Yu, John Volpi, and Stephen T. C. Wong",
        "years": "2021",
        "description": "Published in 2021 EMBC."
      },
      {
        "company": "Chr20q amplification defines a distinct molecular subtype of microsatellite stable colorectal cancers.",
        "title": "Zhang, B., Yao, K., et al. ",
        "years": "2021",
        "description": "Published in Cancer Research"
      },
      {
        "company": "Long-term Stability of Bilayer MoS2 in Ambient Air. arXiv preprint arXiv:2010.06770. Accepted for publication in Advanced Materials Interfaces.",
        "title": "Femi-Oyetoro, J. D., Yao, K., et al. ",
        "years": "2021",
        "description": "Published in Advanced Materials Interfaces"
      },
      {
        "company": "Growth of Monolayer MoS2 on Hydrophobic Substrates as a Novel and Feasible Method to Prevent the Ambient Degradation of Monolayer MoS2.",
        "title": "Yao, K., et al. ",
        "years": "2020",
        "description": "Published in MRS Advances"
      },
      {
        "company": "Rapid ambient degradation of monolayer MoS2 after heating in air.",
        "title": "Yao, K., et al. ",
        "years": "2020",
        "description": "Published in 2D Materials"
      },
      {
        "company": "Effects of high-dosage focused electron-beam irradiation at energies≤ 30 keV on graphene on SiO2.",
        "title": "Femi-Oyetoro, J. D., Yao, K., et al. ",
        "years": "2019",
        "description": "Published in Applied Surface Science"
      },
      {
        "company": "Mechanism for etching of exfoliated graphene on substrates by low-energy electron irradiation from helium plasma electron sources.",
        "title": "Femi-Oyetoro, J. D., Yao, K., et al.",
        "years": "2019",
        "description": "Published in Journal of Vacuum Science & Technology A: Vacuum, Surfaces, and Films"
      }
    ],
    "awards": [
      {
        "company": "Astronaut Scholarship Foundation",
        "title": "Astronaut Scholar",
        "years": "2022",
        "description": "Astronaut Scholars are among the best and brightest minds in STEM"
      },
      {
        "company": "Treehacks",
        "title": "Treehacks most technically complex grand prize winner",
        "years": "2021",
        "description": "Treehacks is one of the largest and most prestigious hackathons in the world, hosted by Stanford."
      },
      {
        "company": "Barry M. Goldwater Foundation",
        "title": "Barry M. Goldwater Scholarship recipient",
        "years": "2020",
        "description": "The Barry M. Goldwater Scholarship is the most prestigious undergraduate research scholarship."
      },
      {
        "company": "Davidson Fellows Scholarship",
        "title": "Davidson Fellows Scholarship $10,000 recipient",
        "years": "2020",
        "description": "Prestigious scholarship awarded to 20 researchers in the US"
      },
      {
        "company": "National Junior Science and Humanities Symposium",
        "title": "2nd place in physical sciences overall",
        "years": "2019",
        "description": "Prestigious national research presentation competition where 250 top researchers from around the nation compete for the top 3 spots."
      }
    ],
    "skills": [
      {
        "name": "Git",
        "level": "60%"
      },
      {
        "name": "Machine learning: Pytorch, Octave, fastai",
        "level": "75%"
      },
      {
        "name": "R",
        "level": "80%"
      },
      {
        "name": "C/C++/C#",
        "level": "90%"
      },
      {
        "name": "Python",
        "level": "80%"
      },
      {
        "name": "Django",
        "level": "50%"
      },
      {
        "name": "Unity",
        "level": "80%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Scope Research",
        "category": "My nonprofit organization to connect high school students to research opportunities.",
        "image": "microscopeIcon.png",
        "url": "https://stevenyao.me/scoperesearch/"
      },
      {
        "title": "NoFall",
        "category": "Hackathon project at Treehacks that won the prize for most technically complex grand prize winner. ",
        "image": "NoFall.png",
        "url": "https://devpost.com/software/nofall"
      },
      {
        "title": "CNNs to diagnose COVID-19 from X-Ray Images of the Chest",
        "category": "Using machine learning to differentiate between the X-ray images of patients with COVID-19, influenza, and without disease.",
        "image": "lung.jpeg",
        "url": "https://devpost.com/software/cnns-to-diagnose-covid-19-from-x-ray-images-of-the-chest?ref_content=user-portfolio&ref_feature=in_progress"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "His research is on the same level as a 2nd or 3rd year graduate student, and would qualify him for a pH.D. in our department",
        "user": "Dr. Jose Perez, research PI at physics lab in UNT"
      },
      {
        "text": "I have mentored and supervised 58 MS/PhD/MD-PhD students and 45 senior undergraduates at UC Berkeley, UCSF, Harvard University, and Rice University, many of them are full or chair professors in academia or senior scientists in industry. Kevin is among the top few undergraduates I have worked with. ",
        "user": "Dr. Stephen Wong, research PI at Houston Methodist"
      }
    ]
  }
}
